<!--
 * @Author: 谭洁莹
 * @Date: 2025-09-05 17:31:45
 * @LastEditTime: 2025-09-08 09:24:57
 * @FilePath: /components/content/icl/ActivityButton.vue
 * @Description: 悬浮引流，用于在首页和ICL页面跳转到活动页
-->
<template>
  <div class="activity z-[100] relative">
    <input type="checkbox" id="activity" class="toggle" />
    <div class="activity-main fixed -right-[10px] bottom-[250px] md:bottom-[185px]">
      <label for="activity">
        <div
          class="close cursor-pointer w-7 md:w-[63.85px] h-7 md:h-[63.85px] absolute flex justify-center items-center top-1 left-[5px] md:top-[9.46px] md:left-[11.82px]"
        >
          <svg
            class="w-[9.6px] md:w-[22.702px]"
            xmlns="http://www.w3.org/2000/svg"
            width="28"
            height="29"
            viewBox="0 0 28 29"
            fill="#fff"
          >
            <path
              d="M2.58057 3.21545L25.2828 25.9177"
              stroke="white"
              stroke-width="4.8"
              stroke-linecap="round"
            />
            <path
              d="M25.283 3.21545L2.58076 25.9177"
              stroke="white"
              stroke-width="4.8"
              stroke-linecap="round"
            />
          </svg>
        </div>
      </label>
      <div class="icon">
        <nuxt-link to="/ICLtalk2025">
          <div class="icon-icl">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="119"
              height="120"
              viewBox="0 0 119 120"
              fill="none"
            >
              <path
                d="M108.799 46.5738C108.799 46.5738 108.74 46.5653 108.669 46.5408C108.628 46.5197 108.569 46.5112 108.54 46.5078C107.622 46.2274 104.496 45.0903 101.859 41.5646C98.721 37.3672 95.1301 32.7762 95.1301 32.7762C95.1301 32.7762 91.7278 28.0174 88.6024 23.8377C85.9666 20.3121 85.7545 16.9837 85.7418 16.0219C85.7341 15.9754 85.7538 15.9335 85.746 15.887C85.758 15.7985 85.7502 15.752 85.7502 15.752L85.7375 15.7357C85.7381 14.6857 85.4117 13.6193 84.7343 12.7133C83.0524 10.4636 79.8574 10.0076 77.6121 11.6959C61.4937 24.448 52.3557 28.6469 52.3557 28.6469C49.081 30.0092 45.0188 32.382 40.9133 35.4697C36.8078 38.5574 33.3988 41.8039 31.1782 44.5762C31.1782 44.5762 24.6013 52.199 7.88044 64.1453C5.63513 65.8336 5.17746 69.0374 6.85936 71.2871C7.53674 72.1932 8.46599 72.8063 9.47115 73.1L9.48394 73.1163C9.48394 73.1163 9.54313 73.1247 9.61373 73.1492C9.65531 73.1703 9.7145 73.1788 9.74352 73.1822C10.6607 73.4626 13.7871 74.5997 16.4242 78.1254C19.5622 82.3228 23.1531 86.9138 23.1531 86.9138C23.1531 86.9138 26.5554 91.6726 29.6808 95.8524C32.3166 99.3779 32.5287 102.706 32.5414 103.668C32.5491 103.715 32.5294 103.757 32.5372 103.803C32.5252 103.892 32.5329 103.938 32.5329 103.938L32.5457 103.954C32.5451 105.004 32.8715 106.071 33.5489 106.977C35.2308 109.226 38.4258 109.682 40.6711 107.994C56.7895 95.242 65.9275 91.0431 65.9275 91.0431C69.2022 89.6808 73.2644 87.308 77.3699 84.2203C81.4754 81.1326 84.8844 77.8861 87.105 75.1139C87.105 75.1139 93.6819 67.491 110.403 55.5448C112.648 53.8564 113.106 50.6526 111.424 48.4029C110.746 47.4969 109.817 46.8837 108.799 46.5738Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M11.7149 67.9526C11.7971 67.4605 11.4659 66.9952 10.9752 66.9132C10.4845 66.8312 10.0201 67.1637 9.93789 67.6557C9.8557 68.1478 10.1869 68.6131 10.6776 68.6951C11.1683 68.7771 11.6327 68.4446 11.7149 67.9526Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M108.425 51.1833C108.127 50.7843 107.562 50.7037 107.164 51.0032C106.766 51.3027 106.685 51.8689 106.983 52.2679C107.282 52.667 107.846 52.7476 108.245 52.4481C108.643 52.1486 108.724 51.5823 108.425 51.1833Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M82.2285 63.7012C84.366 50.9052 75.7544 38.8041 62.9939 36.6725C50.2335 34.5409 38.1562 43.1861 36.0187 55.982C33.8812 68.778 42.4928 80.8791 55.2533 83.0107C68.0138 85.1423 80.091 76.4971 82.2285 63.7012Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M77.4824 21.0649C83.5641 23.9492 89.0566 28.3194 93.3777 34.0995C99.5791 42.3927 102.334 52.2019 101.873 61.8076"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M69.0881 18.111C71.9669 18.7982 74.7814 19.7856 77.4782 21.0643"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M49.1576 101.587C39.7883 99.3489 31.1105 93.9421 24.871 85.5987C18.6696 77.3054 15.9151 67.4963 16.3752 57.8906"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M38.3394 75.4659C38.0411 75.0669 37.4764 74.9862 37.0781 75.2858C36.6799 75.5853 36.5989 76.1515 36.8973 76.5505C37.1956 76.9495 37.7603 77.0302 38.1586 76.7307C38.5568 76.4312 38.6378 75.8649 38.3394 75.4659Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M81.3316 43.1301C81.0333 42.7311 80.4686 42.6504 80.0703 42.9499C79.6721 43.2494 79.5911 43.8157 79.8895 44.2147C80.1878 44.6137 80.7525 44.6944 81.1508 44.3949C81.549 44.0954 81.63 43.5291 81.3316 43.1301Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M59.8707 59.3025C59.5723 58.9035 59.0076 58.8228 58.6094 59.1223C58.2111 59.4218 58.1302 59.9881 58.4285 60.3871C58.7269 60.7861 59.2916 60.8668 59.6898 60.5673C60.0881 60.2677 60.169 59.7015 59.8707 59.3025Z"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M64.3928 21.7145C64.3928 21.7145 64.345 24.3466 58.4145 28.8085C52.4842 33.269 49.5944 32.7664 43.4288 37.4039C37.2632 42.0413 36.9358 44.963 31.004 49.4247C25.0737 53.8852 22.5394 53.1947 22.5394 53.1947"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
              <path
                d="M97.1803 65.5464C97.1803 65.5464 94.6476 64.8548 88.7157 69.3164C82.7855 73.7769 82.4565 76.6998 76.2909 81.3372C70.1253 85.9746 67.2368 85.4723 61.3052 89.9326C55.375 94.3931 55.3269 97.0265 55.3269 97.0265"
                stroke="white"
                stroke-width="2"
                stroke-miterlimit="10"
              />
            </svg>
            <p
              class="text-sm md:text-3xl font-bold leading-[1.2] tracking-[1.183px] md:tracking-[3px]"
            >
              <span class="font-en block">ICL</span>講座專場
            </p>
          </div>
        </nuxt-link>
      </div>
    </div>
  </div>
</template>
<style lang="scss" scoped>
.close {
  background: linear-gradient(180deg, #000034 62.5%, #01abcc 100%);
  border-radius: 50%;
}
.toggle {
  display: none;
  &:checked ~ .activity-main {
    display: none;
  }
}
.icon {
  // position: relative;
  border-radius: 50%;
  color: #fff;
  // position: fixed;
  // right: -10px;
  // bottom: 250px;
  text-align: center;
  background-image: linear-gradient(180deg, #000034 62.5%, #01abcc 100%);
  &-icl {
    width: 103.602px;
    height: 103.602px;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    svg {
      width: 47.87px;
      height: auto;
    }
  }
}
@media screen and (min-width: 768px) {
  .icon {
    bottom: 170px;
    &-icl {
      width: 245px;
      height: 245px;
      svg {
        width: 111.312px;
        height: auto;
      }
    }
  }
}
</style>
